html/docker/kubernates-handbook/manual/config/secret.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Secret 配置</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="probness.html"> UP </a>
 |
 <a accesskey="H" href="config.html"> HOME </a>
</div><div id="content">
<h1 class="title">Secret 配置</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga4ad27d">概览</a>
<ul>
<li><a href="#org649a69c">内置 secret</a>
<ul>
<li><a href="#org5837c23">Service Account 使用 API 凭证自动创建和附加 secret</a></li>
</ul>
</li>
<li><a href="#org6c99e4e">创建</a>
<ul>
<li><a href="#orgc01d50f">使用 kubectl</a></li>
<li><a href="#org4ca76d6">手动创建</a></li>
<li><a href="#org58e6bff">解码 Secret</a></li>
</ul>
</li>
<li><a href="#org3fcab24">使用</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Secret 对象类型用来保存 <b>敏感</b> 信息
</p>

<pre class="example">
  例如密码、OAuth 令牌和 ssh key
</pre>

<p>
将这些信息放在 secret 中比放在 pod 的定义中或者 docker 镜像中来说更加安全和灵活
</p>
<div id="outline-container-orga4ad27d" class="outline-2">
<h2 id="orga4ad27d">概览</h2>
<div class="outline-text-2" id="text-orga4ad27d">
<p>
Secret 是一种包含少量敏感信息例如密码、token 或 key 的对象。这样的信息可能会被放在 Pod spec 中或者镜像中
</p>

<pre class="example">
  将其放在一个 secret 对象中可以更好地控制它的用途，并降低意外暴露的风险
</pre>

<p>
用户可以创建 secret，同时系统也创建了一些 secret 
</p>

<p>
要使用 secret，pod 需要引用 secret。Pod 可以用两种方式使用 secret：
</p>
<ol class="org-ol">
<li>作为 volume 中的文件被挂载到 pod 中的一个或者多个容器里</li>
<li>当 kubelet 为 pod 拉取镜像时使用</li>
</ol>
</div>
<div id="outline-container-org649a69c" class="outline-3">
<h3 id="org649a69c">内置 secret</h3>
<div class="outline-text-3" id="text-org649a69c">
</div>
<div id="outline-container-org5837c23" class="outline-4">
<h4 id="org5837c23">Service Account 使用 API 凭证自动创建和附加 secret</h4>
<div class="outline-text-4" id="text-org5837c23">
<p>
Kubernetes 自动创建包含访问 API 凭据的 secret，并自动修改 pod 以使用此类型的 secret
</p>

<pre class="example">
  如果需要，可以禁用或覆盖自动创建和使用API凭据

  但是，如果需要的只是安全地访问 apiserver，推荐这样的工作流程
</pre>
</div>
</div>
</div>
<div id="outline-container-org6c99e4e" class="outline-3">
<h3 id="org6c99e4e">创建</h3>
<div class="outline-text-3" id="text-org6c99e4e">
</div>
<div id="outline-container-orgc01d50f" class="outline-4">
<h4 id="orgc01d50f">使用 kubectl</h4>
<div class="outline-text-4" id="text-orgc01d50f">
<p>
假设有些 pod 需要访问数据库。这些 pod 需要使用的用户名和密码在本地机器的 ./username.txt 和 ./password.txt 文件里：
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #5f9ea0; font-style: italic;"># </span><span style="color: #5f9ea0; font-style: italic;">Create files needed for rest of example.</span>
$ echo -n <span style="color: #deb887;">"admin"</span> &gt; ./username.txt
$ echo -n <span style="color: #deb887;">"1f2d1e2e67df"</span> &gt; ./password.txt
</pre>
</div>

<p>
kubectl create secret 命令将这些文件打包到一个 Secret 中并在 API server 中创建了一个对象：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ kubectl create secret generic db-user-pass --from-file=./username.txt --from-file=./password.txt
secret <span style="color: #deb887;">"db-user-pass"</span> created
</pre>
</div>

<p>
可以这样检查刚创建的 secret：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ kubectl get secrets
NAME                  TYPE                                  DATA      AGE
db-user-pass          Opaque                                2         51s

$ kubectl describe secrets/db-user-pass
Name:            db-user-pass
Namespace:       default
Labels:          &lt;none&gt;
Annotations:     &lt;none&gt;

Type:            Opaque

Data
====
password.txt:    12 bytes
username.txt:    5 bytes
</pre>
</div>

<pre class="example">
  请注意，默认情况下，get 和 describe 命令都不会显示文件的内容

  这是为了防止将 secret 中的内容被意外暴露给从终端日志记录中刻意寻找它们的人
</pre>
</div>
</div>
<div id="outline-container-org4ca76d6" class="outline-4">
<h4 id="org4ca76d6">手动创建</h4>
<div class="outline-text-4" id="text-org4ca76d6">
<p>
可以先以 json 或 yaml 格式在文件中创建一个 secret 对象，然后创建该对象：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ echo -n <span style="color: #deb887;">"admin"</span> | base64
<span style="color: #4eee94;">YWRtaW4</span>=
$ echo -n <span style="color: #deb887;">"1f2d1e2e67df"</span> | base64
MWYyZDFlMmU2N2Rm
</pre>
</div>

<pre class="example">
  每一项必须是 base64 编码
</pre>

<p>
现在可以像这样写一个 secret 对象：
</p>

<pre class="example">
apiVersion: v1
kind: Secret
metadata:
  name: mysecret
type: Opaque
data:
  username: YWRtaW4=
  password: MWYyZDFlMmU2N2Rm
</pre>

<p>
数据字段是一个映射。它的键必须匹配 DNS_SUBDOMAIN，前导点也是可以的。这些值可以是任意数据，使用 base64 进行编码。使用 kubectl create创建 secret：
</p>
<div class="org-src-container">
<pre class="src src-sh">$ kubectl create -f ./mysecret.yaml
secret <span style="color: #deb887;">"mysecret"</span> created
</pre>
</div>

<pre class="example">
编码注意： secret 数据的序列化 JSON 和 YAML 值使用 base64 编码成字符串。另外：

1. 换行符在这些字符串中无效，必须省略

2. 当在Darwin/OS X上使用 base64 实用程序时，用户应避免使用 -b 选项来拆分长行

3. 对于 Linux用户如果 -w 选项不可用的话，应该添加选项 -w 0 到 base64 命令或管道 base64 | tr -d '\n' 
</pre>
</div>
</div>
<div id="outline-container-org58e6bff" class="outline-4">
<h4 id="org58e6bff">解码 Secret</h4>
<div class="outline-text-4" id="text-org58e6bff">
<p>
可以使用 kubectl get secret 命令获取 secret。例如，获取在上一节中创建的 secret：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ kubectl get secret mysecret -o yaml
apiVersion: v1
data:
  username: <span style="color: #4eee94;">YWRtaW4</span>=
  password: MWYyZDFlMmU2N2Rm
kind: Secret
metadata:
  creationTimestamp: 2016-01-22T18:41:56Z
  name: mysecret
  namespace: default
  resourceVersion: <span style="color: #deb887;">"164619"</span>
  selfLink: /api/v1/namespaces/default/secrets/mysecret
  uid: cfee02d6-c137-11e5-8d73-42010af00002
<span style="color: #f08080;">type</span>: Opaque
</pre>
</div>

<p>
解码密码字段：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ echo <span style="color: #deb887;">"MWYyZDFlMmU2N2Rm"</span> | base64 --decode
1f2d1e2e67df
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3fcab24" class="outline-3">
<h3 id="org3fcab24">使用</h3>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
